     A                                      UNIQUE
     A          R CAMOV01
     A            K00001         9A
     A            F00001        71A
     A          K K00001