**free

ctl-opt main(main); 
// ------------------------------------------------------------------------------------
// main
// ------------------------------------------------------------------------------------
dcl-proc main;

    dsply 'hola mundo';
    

    return;
end-proc;