/* ACTUALIZA CODIGO ESTADO DE FIN DE PROCESO DEL DIA                */
/* BAJA DE COBRANZAS                                                */
             PGM

             SNDPGMMSG  MSG(' REX150 - ACTUALIZA CODIGO DE ESTADO DE +
                          FIN PROCESO COBRANZA') TOPGMQ(*EXT) +
                          MSGTYPE(*COMP)
             OVRDBF     FILE(REXBAJ) TOFILE(REX.BAJ)
             CALL       PGM(EXP.LIBR/REX150NW)

             ENDPGM
