 CMD PROMPT('Recupera configuración')             
                                                                 
 /* Contexto Configuracion */                                          
 PARM KWD(CONTEXT) TYPE(*CHAR) LEN(20) PROMPT('Contexto')                
                                                                 
 /* Clave Configuracion */                                          
 PARM KWD(Key) TYPE(*CHAR) LEN(50) PROMPT('')                                                                     

 /* Valor Configuracion */                                          
 PARM KWD(Value) TYPE(*CHAR) LEN(200) PROMPT('Valor')  