pgm
 /*   Cree la unidad de cinta vrtual y varíela en:   */
       CRTDEVTAP DEVD(VRTDEV) RSRCNAME(*VRT)
 MONMSG     MSGID(CPF0000)
      VRYCFG CFGOBJ(VRTDEV) CFGTYPE(*DEV) STATUS(*ON)
 MONMSG     MSGID(CPF0000)

DLTF FILE(QUSRBRM/QZRBRMLOGS)
 MONMSG     MSGID(CPF0000)
             DLYJOB     DLY(5)

             ENDPGM
